PetPulseCLE/PetPulse/firmware/sdkconfig.defaults
# Enable Power Management
CONFIG_PM_ENABLE=y

# Set flash size
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

CONFIG_IDF_TARGET_ESP32S3=y
CONFIG_IDF_TARGET="esp32s3"

# Set max CPU Frequency for ESP32S3
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_MHZ=240

# ---- 8MB Octal PSRAM (N16R8) ----
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=n
CONFIG_SPIRAM_MEMTEST=y

# Place SPI in IRAM
CONFIG_SPI_MASTER_IN_IRAM=y
CONFIG_SPI_MASTER_ISR_IN_IRAM=y
CONFIG_SPI_SLAVE_ISR_IN_IRAM=y

# UART ISR in IRAM
CONFIG_UART_ISR_IN_IRAM=y

# ---- Bluetooth (NimBLE) for tap-to-pair ----
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_NVS_PERSIST=y
CONFIG_BT_NIMBLE_SM_LEGACY=y
CONFIG_BT_NIMBLE_SM_SC=y
CONFIG_BT_NIMBLE_MAX_BONDS=5
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=3

# ---- RTC: External 32.768 kHz crystal (GPIO15/16) ----
# CONFIG_RTC_CLK_SRC_EXT_CRYS=y

# ---- Console via onboard USB (USB Serial/JTAG on GPIO19/20) ----
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y


# ---- Use NimBLE as the BLE host ----
CONFIG_BT_CONTROLLER_ENABLED=y
CONFIG_BT_CONTROLLER_ONLY=n
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=8192

# ---- Config to use up to 16 characteristics ----
CONFIG_BT_NIMBLE_MAX_CCCDS=16

# ---- Disable all NimBLE defined services to use our own ----
CONFIG_BT_NIMBLE_CTS_SERVICE=n
CONFIG_BT_NIMBLE_BAS_SERVICE=n
CONFIG_BT_NIMBLE_HR_SERVICE=n
CONFIG_BT_NIMBLE_PROX_SERVICE=n
CONFIG_BT_NIMBLE_ANS_SERVICE=n
CONFIG_BT_NIMBLE_HTP_SERVICE=n
CONFIG_BT_NIMBLE_IPSS_SERVICE=n
CONFIG_BT_NIMBLE_TPS_SERVICE=n
CONFIG_BT_NIMBLE_IAS_SERVICE=n
CONFIG_BT_NIMBLE_LLS_SERVICE=n
CONFIG_BT_NIMBLE_SPS_SERVICE=n
CONFIG_BT_NIMBLE_DIS_SERVICE=n


# ---- esp32_BNO08x ----
#

# ---- GPIO Configuration ----
CONFIG_ESP32_BNO08X_GPIO_HINT=21
CONFIG_ESP32_BNO08X_GPIO_RST=8
CONFIG_ESP32_BNO08X_GPIO_CS=2
CONFIG_ESP32_BNO08X_GPIO_SCL=39
CONFIG_ESP32_BNO08X_GPIO_DI=41
CONFIG_ESP32_BNO08X_GPIO_SDA=40
# end of GPIO Configuration